web/websocket_stresstest.yml
# Use with NPM Artillery to stress test up to 750 concurrent websocket clients on a single room
config:
  target: "wss://localhost:8000/api/ws?room=233"
  phases:
    - duration: 30
      arrivalRate: 200
      maxVusers: 1000
      name: "Adding up to 1000 Users"
  ws:
    rejectUnauthorized: false
scenarios:
  - engine: "ws"
    flow:
      - loop:
        - send: '{"type": "ping"}'
        - think: 1
        count: 40